Tekla.Structures.Drawing.DrawingHandler.SetMessageExecutionStatus(Tekla.Structures.Drawing.DrawingHandler.MessageExecutionModeEnum)
Sets the message execution mode for the application.
Mode: The new mode.
Returns: The old message execution mode.
Tekla.Structures.Drawing.DrawingHandler.MessageExecutionModeEnum

Tekla.Structures.Drawing.DrawingHandler.SetActiveDrawing(Tekla.Structures.Drawing.Drawing)
Sets the active drawing that is currently open in Tekla Structures.
Drawing: The drawing to be set as the active drawing.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.SetActiveDrawing(Tekla.Structures.Drawing.Drawing,System.Boolean)
Sets the active drawing that is currently open in Tekla Structures.
Drawing: The drawing to be set as the active drawing.
ShowDrawing: Whether to open the drawing as visible or in the background (faster).
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.CloseActiveDrawing(System.Boolean)
Closes the drawing editor.
Save: Whether the active drawing should be saved on close.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.PrintDrawing(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.PrintAttributes)
Prints the drawing using the given printer instance.
NOTE! The drawing cannot be active, otherwise printing fails.
Drawing: The drawing to be printed.
PrintAttributes: The print attributes for the print job.
Returns: True on success, false if printing fails.

Tekla.Structures.Drawing.DrawingHandler.PrintDrawing(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.PrintAttributes,System.String)
Prints the drawing to file using the given printer instance.
NOTE! The drawing cannot be active, otherwise printing fails.
Drawing: The drawing to be printed.
PrintAttributes: The print attributes for the print job.
FileName: The name of the output file.
Returns: True on success, false if printing fails.